mhanuel26/WifiSetupAndDeviceControlViaBleCentral/Nrf52App/nordic/main.c
    if(!use_whitelist)
    {
        // Disconnect currently connected device before starting advertising to all.
        if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
        {
            ret = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if(ret != NRF_SUCCESS)
            {
                NRF_LOG_INFO("ERROR: Fail to disconnect central device with error: %d.", ret);
                return ret;
            }
        }
        m_advertising.adv_mode_current = BLE_ADV_MODE_FAST;
        ret = ble_advertising_restart_without_whitelist(&m_advertising);
    }
    else
    {
        // Start advertising to bonded devices only, if there is at least one bonded device and no device is currently connected.
        if(m_advertising.adv_mode_current != BLE_ADV_MODE_IDLE)
        {
            (void) sd_ble_gap_adv_stop(m_advertising.adv_handle);
        }
        if(pm_peer_count() > 0 && m_conn_handle == BLE_CONN_HANDLE_INVALID)
        {
            whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
            m_advertising.whitelist_temporarily_disabled = false;
            m_advertising.whitelist_in_use               = true;
            ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        }
    }
    return ret;
}

/**@brief Clear bond information from persistent storage.
 */
static int delete_bonds(void)
{
    // Disconnect currently connected device before deleting all bonds.
    if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
    {
        ret_code_t ret = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
        if(ret != NRF_SUCCESS)
        {
            NRF_LOG_INFO("ERROR: Fail to disconnect central device with error: %d.\n", ret);
            return ret;
        }
    }

    if(pm_peer_count() > 0)
    {
        NRF_LOG_INFO("Erase bonds!");
        ret_code_t ret = pm_peers_delete();
        if(ret != NRF_SUCCESS)
        {
            NRF_LOG_INFO("ERROR: Fail to erase bonds with error: %d.\n", ret);
            return ret;
        }
        return ble_start_advertising_handler(m_advertising_with_whitelist);
    }
    NRF_LOG_INFO("No bonds to erase!");
    return 0;
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
    pm_handler_on_pm_evt(p_evt);
    pm_handler_flash_clean(p_evt);

    switch (p_evt->evt_id)
    {
        case PM_EVT_PEERS_DELETE_SUCCEEDED:
            ble_start_advertising_handler(m_advertising_with_whitelist);
            break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
            if (     p_evt->params.peer_data_update_succeeded.flash_changed
                 && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING))
            {
                NRF_LOG_INFO("New Bond, add the peer to the whitelist if possible");
                // Note: You should check on what kind of white list policy your application should use.

                whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);
            }
            break;

        default:
            break;
    }
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        int result = message_protocol_send_data_via_uart(p_evt->params.rx_data.p_data, 
                                                         p_evt->params.rx_data.length);

        if(result != 0)
        {
            NRF_LOG_ERROR("Failed to send UART data.");
        }
    }

}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module
 *          which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by simply setting
 *       the disconnect_on_fail config parameter, but instead we use the event handler
 *       mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
    uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
    APP_ERROR_CHECK(err_code);

    // Prepare wakeup buttons.
    err_code = bsp_btn_ble_sleep_mode_prepare();
    APP_ERROR_CHECK(err_code);

    // Clean up message protocols
    ble_control_message_protocol_clean_up();
    message_protocol_clean_up();

    // Go to system-off mode (this function will not return; wakeup will cause a reset).
    err_code = sd_power_system_off();

    // NOTE: If the chip is in debug interface mode when sd_power_system_off() is called,
    // the chip will enter emulated system off mode, and this will lead to the CPU executing
    // code after the call. It is recommended, therefore, to add an infinite loop after calling
    // sd_power_system_off().
    #ifdef DEBUG_NRF
    while(1);
    #else
    APP_ERROR_CHECK(err_code);
    #endif
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
    ret_code_t err_code;

    switch (ble_adv_evt)
    {
        case BLE_ADV_EVT_DIRECTED_HIGH_DUTY:
            NRF_LOG_INFO("High Duty Directed advertising.");
            err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING_DIRECTED);
            APP_ERROR_CHECK(err_code);
            break;

