mhanuel26/WifiSetupAndDeviceControlViaBleCentral/Nrf52App/nordic/main.c
            case APPCMD_SET_LED_ON_OFF_ALL:
                for(int i = 2; i >= 0; i--)
                {
                    mask = mask << 8 | agg_cmd[1 + i];
                }
                led_status_on_off_send_by_mask(agg_cmd[0], mask);
                break;
                
            case APPCMD_POST_CONNECT_MESSAGE:
                post_connect_message(agg_cmd[0]);
                break;
            
            case APPCMD_DISCONNECT_PERIPHERALS:
                disconnect_all_peripherals();
                break;

            case APPCMD_DISCONNECT_CENTRAL:
                sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                break;
            
            case APPCMD_TEST_CMD:     //6
                led_status_send_to_all(agg_cmd[0]);
                break;

            default:
                break;
        }
        agg_cmd_received = 0;
    }
    else
    {
        NRF_LOG_WARNING("AGG CMD ZERO -ERROR!!\r\n");

    }
}

/**@brief Application main function.
 */
int main(void)

 {
    // Initialize.
    message_protocol_init(send_data_to_ble_nus);
    ble_control_message_protocol_init(init_ble_stack, \
                                    set_ble_passkey, \
                                    ble_start_advertising_handler, \
                                    delete_bonds, \
                                    process_app_commands, 
                                    get_aggregator_data);

    log_init();
    timers_init();
    leds_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    scan_init();
    gatt_init();
    db_discovery_init(); // discovering and handler attaching to ble led button...
    lbs_c_init();
    thingy_uis_c_init();

    NRF_LOG_INFO("Azure CENTRAL scan start");

    for (int i = 0; i < NRF_SDH_BLE_TOTAL_LINK_COUNT; ++i){
        m_coded_phy_conn_handle[i] = BLE_CONN_HANDLE_INVALID;
    }
    scan_start(false);
    // Turn on the LED to signal scanning.
    bsp_board_led_on(CENTRAL_SCANNING_LED);

    ble_control_message_protocol_send_device_up_event();

    // Enter main loop.
    for (;;)
    {
//        if(m_conn_handle != BLE_CONN_HANDLE_INVALID)
//        {
//            while(app_aggregator_flush_ble_commands());
//        }
        idle_state_handle();
    }
}

/**
 * @}
 */
